const factTexts = [
    "สาขาวิศวกรรมคอมพิวเตอร์และ IoT ยินดีต้อนรับ!",
    "เราเน้นเรียนรู้ทั้ง Hardware และ Software 💻🔌",
    "จบไปเป็นโปรแกรมเมอร์ หรือ IoT Engineer ได้สบาย!",
    "รู้หรือไม่? IoT ทำให้สิ่งของคุยกันเองได้ผ่านเน็ต",
    "เรียนจริง ทำจริง พร้อมต่อยอด",
    "อยากเขียนโค้ด ควบคุมอุปกรณ์ และวิเคราะห์ข้อมูล? IoT คือคำตอบ"
];

const questions = [
    { q: "IoT ย่อมาจากคำว่าอะไร?", choices: ["Internet of Technology", "Internet of Things","Information of Technology","Internet of Tools"], ans: 1 },
    { q: "บอร์ดใดนิยมใช้ในการเรียนรู้ IoT มากที่สุด?", choices: ["VGA Card", "Motherboard", "ESP32 / Arduino"], ans: 2 },
    { q: "1 Byte มีค่าเท่ากับกี่ Bit?", choices: ["4 Bit", "8 Bit", "16 Bit", "32 Bit"], ans: 1 },
    { q: "กฎของโอห์ม (Ohm's Law) คือสมการใด?", choices: ["P = I * V", "F = m * a", "V = I * R", "E = mc^2"], ans: 2 },
    { q: "IoT ควบคุมอุปกรณ์จากระยะไกลได้ไหม?", choices: ["ได้", "ไม่ได้"], ans: 0 },
{ q: "ข้อใดคือแนวคิดของคำว่า IoT", choices: ["การเชื่อมต่ออุปกรณ์ต่าง ๆ ผ่านอินเทอร์เน็ต", "การสร้างเว็บไซต์", "การออกแบบกราฟิก", "การเขียนบทความ"], ans: 0 },
{ q: "เซนเซอร์ในระบบ IoT มีหน้าที่อะไร", choices: ["ตรวจจับข้อมูลจากสิ่งแวดล้อม", "วาดภาพ", "พิมพ์เอกสาร", "เล่นเพลง"], ans: 0 },
{ q: "ข้อมูลที่ได้จากเซนเซอร์จะถูกส่งไปที่ใด", choices: ["กระดาษ", "สมุดบันทึก", "หนังสือ", "ระบบประมวลผลหรือ Cloud"], ans: 3 },
{ q: "Cloud Computing ใน IoT ใช้ทำอะไร", choices: ["วิเคราะห์ข้อมูล", "เก็บและประมวลผลข้อมูล", "รวบรวมข้อมูล", "ไม่มีข้อใดถูกต้อง"], ans: 1 },
{ q: "ข้อใดสามารถควบคุมอุปกรณ์ผ่านระบบ IOT ได้บ้าง", choices: ["สวิตไฟ", "แอร์", "ลำโพง", "ถูกทุกข้อ"], ans: 3 },
{ q: "ข้อใดเป็นตัวอย่างของ Smart Home", choices: ["เปิด–ปิดไฟผ่านมือถือ", "ระบบล็อกประตู", "กล้องวงจรปิดออนไลน์", "ถูกทุกข้อ"], ans: 3 },
{ q: "ข้อใดคือประโยชน์ของ IoT", choices: ["เพิ่มความสะดวกสบาย", "ประหยัดพลังงาน", "เพิ่มประสิทธิภาพการทำงาน
", "ถูกทุกข้อ"], ans: 3 },
{ q: "IoT สามารถใช้ในด้านใดได้บ้าง", choices: ["การแพทย์", "การเกษตร", "การค้า", "ถูกทุกข้อ"], ans: 3 },
{ q: "ไมโครคอนโทรลเลอร์คืออะไร?", choices: ["ไมโครคอนโทรลเลอร์คืออุปกรณ์ที่ใช้ในการเก็บข้อมูลเท่านั้น", "
ไมโครคอนโทรลเลอร์คืออุปกรณ์ที่ใช้ในการสื่อสารระหว่างผู้คน", "ไมโครคอนโทรลเลอร์คือคอมพิวเตอร์ขนาดใหญ่ที่ใช้ในการประมวลผลข้อมูล", "ไมโครคอนโทรลเลอร์คืออุปกรณ์อิเล็กทรอนิกส์ที่ใช้ในการควบคุมอุปกรณ์ต่างๆ โดยรวม CPU, หน่วยความจำ, และอุปกรณ์เชื่อมต่อในชิปเดียว"], ans: 3 },
{ q: "ไมโครคอนโทรลเลอร์ทำงานอย่างไร?", choices: ["ไมโครคอนโทรลเลอร์ทำงานโดยการเชื่อมต่อกับอินเทอร์เน็ต", "ไมโครคอนโทรลเลอร์ทำงานโดยการประมวลผลข้อมูลและควบคุมอุปกรณ์ต่างๆ ตามโปรแกรมที่กำหนด", "ไมโครคอนโทรลเลอร์ทำงานโดยการเก็บข้อมูลในหน่วยความจำ", "ไมโครคอนโทรลเลอร์ทำงานโดยการสร้างภาพกราฟิก"], ans: 1 },
{ q: "MCU เป็นชื่อเรียกของอะไร", choices: ["หน่วยประมวลผลกลาง", "ไมโครโปรเซสเซอร์", "ไมโครคอนโทรลเลอร", "หน่วยความจำ"], ans: 2 },
{ q: "โปรแกรมของ Arduino แบ่งได้ เป็นสองส่วนคือ", choices: ["void setup() และ void loop()", "voidvoid () และ setup loop()", "setupvoid () และ loopvoid ()", "setup() และ loop()"], ans: 0 },
{ q: "ในการทดลองเขียนโปรแกรมควบคุมอุปกรณ์อิเล็กทรอนิคหรืออุปกรณ์ไฟฟ้า เพื่อความสะดวกและไม่ต้องบัคกรีเรานิยม เสียบอุปกรณ์ดังกล่าวกับ อุปกรณ์ใด", choices: ["microcontroller board", "Breadboard หรือ Protoboard", "Key board", "Arduino UNO R3"], ans: 1 },
{ q: "delay(500); คือ", choices: ["หน่วงเวลา 500 มิลลิวินาที", "หน่วงเวลา 500 วินาที", "หน่วงเวลา 50 มิลลิวินาที", "หน่วงเวลา 50 วินาที"], ans: 0 },
{ q: "ไฟเลี้ยงของบอร์ดเมื่อต้องการจ่ายไฟให้กับวงจรภายนอก ประกอบด้วยขาไฟเลี้ยง +3.3 V, +5V, GND, Vin ใช้ช่องใด",choices: ["Power Port", "MCU", "GND", "INPUT"], ans: 0 },
{ q: "ในการเขียนโปรแกรม และคอมไพล์ลงบอร์ด ใช้โปรแกรมใด", choices: ["Arduino DIE", "
Arduino IDE", "Arduino EDI", "Arduino EDR"], ans: 1 },
{ q: "", choices: ["", "", "", ""], ans:  },
{ q: "ไมโครคอนโทรลเลอร์มีความแตกต่างจากไมโครโปรเซสเซอร์อย่างไร?", choices: ["ไมโครคอนโทรลเลอร์มีความเร็วสูงกว่าไมโครโปรเซสเซอร์", "ไมโครโปรเซสเซอร์ใช้พลังงานมากกว่าไมโครคอนโทรลเลอร์", "ไมโครคอนโทรลเลอร์รวมทุกอย่างในตัวเดียว ขณะที่ไมโครโปรเซสเซอร์ต้องการอุปกรณ์ภายนอก", "ไมโครคอนโทรลเลอร์ไม่สามารถทำงานได้โดยไม่มีไมโครโปรเซสเซอร์"], ans: 2 },
{ q: "อุปกรณ์ใดในปัจจุบันไม่นิยมใช้ ไมโครคอนโทลเลอร์ มีส่วนในการควบคุม", choices: ["สัญญาณไฟจราจร", "รถยนต์", "เครื่องซักผ้า", "ชั้นวางรองเท้า"], ans: 3 },
{ q: "Iron Dome คืออะไร", choices: ["ระบบเลเซอร์วัดระยะห่างอากาศยาน", "ระบบเรดาห์ตรวจจับอากาศยาน", "ระบบป้องกันขีปนาวุธ", "ระบบเตือนภัยอัจฉริยะ"], ans: 2 },
{ q: "โซลาเซลล์ไฮบริดลอยนำ้าที่ใหญ่ที่สุดในโลกอยู่ที่ประเทศอะไร", choices: ["ไทย", "ญี่ปุ่น", "สาธารณรัฐประชาชนจีน", "อินเดีย"], ans: 0 },
{ q: "Net-Zero Emission คืออะไร", choices: ["การยับยั้งการปล่อยก๊าซเรือนกระจกให้เป็นศูนย์", "การปล่อยก๊าซเรือนกระจกให้น้อยที่สุดเท่าที่จะเป็นไปได้", "การชดเชยการปล่อยก๊าซเรือนกระจกทั้งหมด โดยการดูดซับหรือกำาจัดออกจากบรรยากาศ", "การเพิ่มการใช้พลังงานหมุนเวียนในสัดส่วนที่สูงที่สุด"], ans: 2 },
{ q: "เพราะเหตุใดจึงเรียกเครื่องปฏิกรณ์ฟิวชันว่า “ดวงอาทิตย์จำาลอง”", choices: ["เพราะเครื่องปฏิกรณ์ฟิวชันมีอุณหภูมิเท่ากับดวงอาทิตย์", "เพราะเครื่องปฏิกรณ์ฟิวชันใช้พลังงานแสงอาทิตย์ในการทำางาน", "เพราะเครื่องปฏิกรณ์ฟิวชันสามารถสร้างแสงสว่างเท่ากับดวงอาทิตย์", "เพราะเครื่องปฏิกรณ์ฟิวชันจำาลองกระบวนการเกิดพลังงานเช่นเดียวกับในดวงอาทิตย์"], ans: 3 },
{ q: "ประเทศญี่ปุ่นได้ดำเนินการปล่อยนที่ใช้ในการหล่อเย็นเครื่องปฏิกรณ์ที่เกิดอุบัติเหตุที่ฟูกุชิมะ น้ำดังกล่าว ได้ถูกพิจารณาว่ามีสารปนเปื้อนจากรังสี รังสีดังกล่าวมาจากไอโซโทปใด", choices: ["H-13", "U-235", "Ra-226", "Sr-90"], ans: 0 },
{ q: "อุบัติเหตุที่เกิดขึ้นกับเรือดำาน้ำ Titan เกิดจากสาเหตุใด", choices: ["การขาดแคลนออกซิเจนภายในเรือดำาน้ำ", "การขัดข้องของเครื่องยนต์", "โครงสร้างเรือดำาน้ำรับแรงดันใต้น้ำไม่ไหว", "การชนกับภูเขาใต้ทะเล"], ans: 2 },
{ q: "ปรากฏการณ์ “ลานีญา” ส่งผลต่อภูมิอากาศในประเทศไทยอย่างไร", choices: ["ฤดูร้อนจะยาวนานขึ้นและมีอุณหภูมิสูงกว่าปกติ", "ฤดูฝนจะมีฝนตกมากขึ้นและมีความเสี่ยงน้ำท่วมสูงขึ้น", "ฤดูหนาวจะมีอากาศเย็นและแห้งกว่าปกติ", "ฤดูฝนจะมีฝนน้อยลงและมีภัยแล้งบ่อยขึ้น"], ans: 1 },
{ q: "ในสงครามระหว่างรัสเซียกับยูเครน ได้มีการต่อต้านกระสุนเจาะเกราะ เนื่องจากการปนเปื้อนของสาร กัมมันตรังสีในธรรมชาติ สารกัมมันตรังสีในหัวกระสุนเจาะเกราะคือธาตุใด", choices: ["ตะกั่ว", "ซีเซียม", "พลูโตเนียม", "ยูเรเนียม"], ans: 3 },
{ q: "การทำงานของไมโครคอนโทรลเลอร์มีความสำคัญอย่างไรในระบบอัตโนมัติ?", choices: ["ไมโครคอนโทรลเลอร์ช่วยในการควบคุมและประมวลผลข้อมูลในระบบอัตโนมัติ ทำให้การทำงานเป็นไปอย่างมีระเบียบและแม่นยำ", "ไมโครคอนโทรลเลอร์ทำให้ระบบทำงานช้าลง", "ไมโครคอนโทรลเลอร์ไม่เกี่ยวข้องกับระบบอัตโนมัติ", "ไมโครคอนโทรลเลอร์ใช้ในการเก็บข้อมูลเท่านั้น"], ans: 0 },
{ q: "", choices: ["", "", "", ""], ans:  },
{ q: "", choices: ["", "", "", ""], ans:  },
{ q: "ข้อใดเป็นความแตกต่างระหว่างไมโครโปรเซสเซอร์กับไมโครคอนโทรลเลอร์", choices: ["ไมโครคอนโทรลเลอร์มีหน่วยความจำและพอร์ตเชื่อมต่ออุปกรณ์อินพุตและเอาต์พุต", "ไมโครโปรเซสเซอร์มีหน่วยความจำภายใน", "ไมโครโปรเซสเซอร์มีหน่วยความจำและพอร์ตเชื่อมต่ออุปกรณ์อินพุตและเอาต์พุต", "ไมโครคอนโทรลเลอร์ไม่มีความจำภายใน"], ans: 0 },
{ q: "", choices: ["", "", "", ""], ans:  },
{ q: "", choices: ["", "", "", ""], ans:  },
{ q: "", choices: ["", "", "", ""], ans:  },
{ q: "", choices: ["", "", "", ""], ans:  },
{ q: "", choices: ["", "", "", ""], ans:  },
{ q: "", choices: ["", "", "", ""], ans:  },
{ q: "ไมโครคอนโทรลเลอร์สามารถเชื่อมต่อกับเซนเซอร์ได้หรือไม่?", choices: ["เฉพาะบางเซนเซอร์", "ไม่ใช่", "ต้องใช้บอร์ดเสริม", "ใช่"], ans: 3 },
{ q: "โครงสร้างพื้นฐานของไมโครคอนโทรลเลอร์ข้อใดไม่ใช่ส่วนประกอบของโครงสร้าง", choices: ["หน่วยความจำข้อมูล", "หน่วยประมวลกลาง", "วงจรกำเนิดสัญญาณไซน์", "ส่วนติดต่อกับอุปกรณ์ภายนอกหรือพอร์ต"], ans: 2 },
{ q: "การเลือกไมโครคอนโทรลเลอร์สำหรับโปรเจกต์ควรพิจารณาอะไรบ้าง?", choices: ["สีของไมโครคอนโทรลเลอร์", "ขนาดของบรรจุภัณฑ์ไมโครคอนโทรลเลอร์", "ควรพิจารณาความต้องการของโปรเจกต์, จำนวนขา I/O, ความเร็วของ CPU, ขนาดหน่วยความจำ, แหล่งจ่ายไฟ, และความสามารถในการเชื่อมต่อ", "ราคาของไมโครคอนโทรลเลอร์"], ans: 2 }


];
